<p><br />**No entiend&iacute; al/el Half Life 1 (I didn&rsquo;t get it)**<br />**First playthrough vs the next**<br />**If you got no sauce, you lost. But you can also get lost in the sauce.**</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La comunidad. Quer&aacute;moslo por valiente, no por perfecto.</p>
<p>It has sauce,</p>
<p>but not well presented.</p>
<p>Ugly spicy sauce bottle joke,</p>
<p>the bomb or sum.</p>
<p>Y cu&aacute;l es la sauce a la que me refiero.</p>
<p>**Historia:**</p>
<p>**En la primeras horas del juego te dan much&iacute;sima chapa en el tren y luego nadaaaaa.**</p>
<p>Una chapa de qui&eacute;n eres, que haces, donde estas, la importancia de donde estas y luego pasa algo que no esperabas, guay, pero no te vuelven a explicar una puta mierda.</p>
<p>Porque no me invita a frenarme a prestar atenci&oacute;n a los ambientes en busca de informaci&oacute;n del mundo o de lo que co&ntilde;o hago yo aqu&iacute;. Esto me lleva al siguiente punto. La historia.</p>
<p>La historia no existe, no hay. Hay un test fallido, ves a un hombre con traje, &iquest;Qui&eacute;n es? No lo sabes y no lo sabr&aacute;s. Te piden que vayas a buscar ayuda, la ayuda te intenta matar, los matas t&uacute;, sigues pa&rsquo;lante, m&aacute;s bichos, m&aacute;s marines, arregla esto, para que para poder seguir, para que, para matar bichos m&aacute;s gordos con armas cada vez m&aacute;s alien&iacute;genas. Co&ntilde;o un portal, **que cojones (boss final del bebe) &iquest;Pero c&oacute;mo que trabaje contigo, perro?.**</p>
<p>Hay 5 NPCs que te dicen m&aacute;s de una frase en todo el juego. Hay 10 se&ntilde;ales que te dan algo de informaci&oacute;n sobre donde est&aacute;s, pero te dan totalmente igual porque no significan nada para ti.</p>
<p>El prota Freeman es un sieso que mata sin raz&oacute;n. Porque explicarme por favor, porque una vez que sabes que los militares no est&aacute;n para ayudarte, que puta ayuda vas a encontrar. Adem&aacute;s es un fiera, &oacute;sea todo lo que toca lo revienta. Fuera co&ntilde;as se le podr&iacute;a culpar de la mayor&iacute;a de cat&aacute;strofes que pasan en el juego.</p>
<p>Estar&eacute;is pensado que soy retrasado y malo a los juegos y punto. Y ser&aacute; verdad. Pero no ayud&aacute;is a la memoria que se tiene sobre el juego. Parecido con la dificultad y los dark souls, **os recomiendo el video de JoseJu sobre esto.**</p>
<p>El episodia del tren es para matarse. Los de Xen tambi&eacute;n. <br />El boss final es guay la vd</p>
<p>**Gameplay:**</p>
<p>**Quieren que piense antes de actuar pero: (mencionar carcasa)**</p>
<p>**1.**&nbsp;&nbsp;&nbsp; **De normal corres no andas.** Sauce: el movimiento es crema.</p>
<p>**2.**&nbsp;&nbsp;&nbsp; **Los dise&ntilde;os de los niveles no invitan a cambiar de estrategia**: zonas muy parecidas muy frecuentes durante todo el juego con pasillos largos y pocas coberturas.</p>
<p>**3.**&nbsp;&nbsp;&nbsp; **Los enemigos no penalizan el uso de la misma estrategia de siempre**. Correr. De hecho la motivan, con granadas y ataques teledirigidos, que te dan bajo cobertura.</p>
<p>**4.**&nbsp;&nbsp;&nbsp; Desde el principio del juego, encargado de ense&ntilde;ar c&oacute;mo quiere que juegues al juego, la t&aacute;ctica de correr esquivando los ataques y matando solo con la SMG funciona. Y durante el juego no te motivan a que cambies tu estilo.</p>
<p>**Desarrollo gameplay:**</p>
<p>Leyendo chats de Reddit, sobre las respuestas a Half-Life no es tan bueno como dicen.</p>
<p>Alex el capo corri&eacute;ndose en c&aacute;mara al ver el half life 3 anunciado.</p>
<p>Y sinceramente, fue la horrorosa bienvenida de los megafans de HL1, frente a la concepci&oacute;n de que no es juego perfecto, lo que me llevo a hacer este video.</p>
<p>Para que no se me pongan tontitos, lo voy a intentar explicar (que no lo entiendo) a trav&eacute;s de la carcasa original del propio juego. Lo que Valve quer&iacute;a de m&iacute;.</p>
<p>1.RUN. De normal corres, no andas.</p>
<p>**2. THINK (1). Los dise&ntilde;os de los niveles no invitan a cambiar de estrategia**: zonas muy parecidas muy frecuentes durante todo el juego con pasillos largos y pocas coberturas.</p>
<p>**3. THINK (2). Los enemigos no penalizan el uso de la misma estrategia de siempre**. Correr. De hecho la motivan, con granadas y ataques teledirigidos, que te dan bajo cobertura.</p>
<p>Los marines tochos del final chupan balas como nadie pero encuentras suficientes balas para seguir con la misma fukin estrategia.</p>
<p>No paran de tirar granadas lo que literalmente, te obliga a seguir movi&eacute;ndote constantemente. Y es cierto que solo empiezan a tirar granadas cuando te han visto &oacute;sea que has iniciado el combate, &oacute;sea que deber&iacute;as pensar antes de disparar. **Revisar espacios de los niveles para ver si el dise&ntilde;o te invita a poder pensar**. Pero de nuevo, no te invita a ello.</p>
<p>A los bichos con escudo del halo, no te pod&iacute;as acercar a escopetar. Cierto que se acaba rompiendo si sigues haciendo spray; pero eran suficientes balas desperdiciadas para que preguntaras si hay otra manera. Usar las granadas y coberturas. Qu&eacute; tipo de armas desarman antes s los escudos, etc.</p>
<p>**4. SHOOT (Tema uso de armas o la misma arma xd). El juego no cambia de estilo conforme lo juegas? Check**</p>
<p>Desde el principio del juego, encargado de ense&ntilde;ar c&oacute;mo quiere que juegues al juego, la t&aacute;ctica de correr esquivando los ataques y matando solo con la SMG funciona. Y durante el juego no te motivan a que cambies tu estilo.</p>
<p>Claro, en los primeros niveles, cuando no tienes no C4s, ni minas de proximidad, ni bichicos ( broma: QUE POLLAS SON ESTOS BICHOS BTW), tienes que resolver los niveles con lo que tienes, una pistola y un SMG. Conforme avanza el juego los niveles no cambian de estructura, ni a nivel de enemigos, que solo son m&aacute;s tochos (no traen nuevas mec&aacute;nicas de combate) o ni siquiera de forma, se repiten pasillos o b&uacute;nkeres con tanta frecuencia que unido a que el juego no invita directamente a probar cosas nuevas, como quit&aacute;ndote ciertas armas o lo que sea, no hay raz&oacute;n para probar nuevas posibles soluciones a los niveles, lo haces como te lleva funcionando todo el juego.</p>
<p>Si que hay un momento en el que te quitan todas las armas, pero lo primero que recuperas es la pistola. Estamos en las mismas. No reta al jugador.</p>
<p>Al contrario, s&iacute; lo reta a encontrar el camino correcto sin indicaciones, porque no son inteligentes puzles, donde tienes que deducir por donde continuar, es que es una ventanilla que es imposible de ver, la que te hace avanzar. Y que unido a que es un poco chunky con las hitboxes, solo a&ntilde;ade frustaci&oacute;n,</p>
<p>**5. LIVE.**</p>
<p>**El guardado. Tendr&iacute;an que haber quitado el guardado donde quisieras. Lo cogen otros juegos. No hay penalizaci&oacute;n alguna por fallar. Osea s&iacute;, los autoguardados son horrendos por los entiendo. Pero dan igual, solo guarda.**</p>
<p>**The Sauce:**</p>
<p>Osea est&aacute; ah&iacute;, ahora lo veo, que de verdad fueron muy cuidadosos con el dise&ntilde;o de niveles y de verdad que los niveles pueden ser puzles. Tiene multiples soluciones muy buenas.</p>
<p>Misi&oacute;n de los asesinos.</p>
<p>Y dir&eacute;is, como puedes estar tan seguro de esto que dices. **Por el nivel de los asesinos.** Hab&iacute;amos visto a estos enemigos antes, pero nunca por su cuenta, no los entendemos y sabemos son letales (video del tio que te intenta avisar).</p>
<p>Me chifla este nivel, porque veo la intenci&oacute;n del juego original. Es quiz&aacute;s el enemigo m&aacute;s r&aacute;pido del juego, menos quiz&aacute;s el bicho del agua que es m&aacute;s feo que atragantarse con las 12 uvas.&nbsp; Pero seguro que son los primeros enemigos de tierra que son m&aacute;s r&aacute;pidos que t&uacute;, los &uacute;nicos que de verdad pueden huir de tus disparos de SMG, lo que te te obliga, al morir con la misma estrategia de siempre, a replantearte de verdad como matarlos. (video del t&iacute;o usando las minas de proximidad).</p>
<p>Notas la inteligencia por primera vez, notas que tienen un plan para matarte y han sido entrenados para llevarlo a cabo. Adem&aacute;s, su plan es totalmente diferente al de resto de enemigos, no te atacan de frente, buscan tu espalda y puntos ciegos, estudian tus movimientos y cambian su ruta para pillarte desprevenido e incluso saben cogerte la altura para que sean invisibles.</p>
<p>Se noto como resolver un puzle; pero qu&eacute; co&ntilde;o es el nivel de los vagones. M&uacute;sicaca.</p>
<p>De nuevo una cal y otra de avena. Que putada de nivel. Fijate lo que opinan los propios desarrolladores que te dejan pas&aacute;rtelo sin la puta furgoneta de los cojones. Horrible.</p>
<p>**Carcasa.**</p>
<p>**Los gr&aacute;ficos.** La verdad esque aguantan muy bien, no se sienten como un problema enorme. Enorme no cero. Clip de yo muriendo por la puta h&eacute;lice de mierda.</p>
<p>**La inteligencia artificial.**</p>
<p>De lo mejor del juego, los ambientes se sienten vivos y los enemigos inteligentes y muy mejor adaptados al ambiente que t&uacute;. Las rutas de los enemigos Marines son la polla la vd.</p>
<p>Investigar como la hicieron, en que la mejoraron.</p>
<p>**The sacue:**</p>
<p>**&iquest;Qu&eacute; ha inspirado exactamente? &iquest;Qu&eacute; introdujo que era de verdad nuevo y revolucionario?**</p>
<p>La verdad esque es flipante que siendo de los primeros FPS de la historia, intentaran resolver uno de los grandes temas &ldquo;morales/&eacute;ticos&rdquo; que conllevan, digamos. La locura que genera darle un arma a cualquier persona.</p>
<p>Y ahora ver como este tema, **que ya identificaron antes de publicarlo**, ha inspirado juegos enteros y no cualquier juego tampoco eh, ha inspirado el Hotline miami 1 y 2 y el Spec Ops: The line.</p>
<p>**Es incre&iacute;blemente inspirador tambi&eacute;n por sus fallos. Fue el primero en poner la mano en el fuego y naturalmente se quem&oacute; m&aacute;s de una vez. Pero solo esto permiti&oacute; que otros mejoraran el g&eacute;nero. Y por eso s&iacute;, creo que se debe entender a Half-Life como un cl&aacute;sico.**</p>
<p>**No considerarlo perfecto; pero s&iacute; incre&iacute;blemente valiente.**</p>
<p>**Primera vez que lo jugu&eacute;.** Su puta madre, el juego que m&aacute;s largo se me ha hecho en mi vida, quiz&aacute;s porque entr&eacute; pensando que era mucho m&aacute;s corto, pero madre m&iacute;a es interminable, repetitivo, aburrido, vac&iacute;o. Pero veo la sauce en la banda sonora y el enorme ejercicio creativo en el dise&ntilde;o de niveles.</p>
<p>Okey, d&iacute;a siguiente. Veo algo m&aacute;s la sauce. Puedo ver mejor la densidad de opciones de armas. Que **ciertas** partes del juego est&aacute;n dise&ntilde;adas para que pienses antes de actuar. Como los enemigos tienen descritos patrones de coberturas, que dan espacios de combos interesant&iacute;simos al jugar. Como este que hace este video este chico,</p>
<p>https://www.youtube.com/watch?v=dg5EQyw_7Hk&amp;t=685s</p>
<p>Pero porque no los uso.</p>
<p>Porque me hace querer correr por los pasillos como un **cordero** y no utilizar las otras armas tan chulas que de verdad los son. El movimiento, vas follao por el juego, tengo que pisar SHIFT para andar, lo predeterminado es correr.</p>
<p>Tambi&eacute;n porque funcionan. Durante todo el juego funciona que me pueda lanzar con la escopeta a la cara del enemigo y no buscar cobertura. El SMG funciona para literalmente cada pelea. Los marines tochos del final chupan balas como nadie pero encuentras suficientes balas para seguir con la misma fukin estrategia.</p>
<p>**ESTO ME HUELE A EMBOSCADA.**</p>
